# Relationship Types

* Determine if each table is related to another table by one-to-one, one-to-many, or many-to-many relationships using pandas

In [1]:
import pandas as pd

dept_manager_df = pd.read_csv("../dept_manager.csv")

dept_manager_df.head()

  dept_no  emp_no   from_date     to_date
0    d001  110022  1985-01-01  1991-10-01
1    d001  110039  1991-10-01  9999-01-01
2    d002  110085  1985-01-01  1989-12-17
3    d002  110114  1989-12-17  9999-01-01
4    d003  110183  1985-01-01  1992-03-21

In [14]:
#determine the max number identical department numbers
print(max(dept_manager_df["dept_no"].value_counts()))

print("The 'dept_no' primary key in the 'departments' table has " +
      "a one-to-many relationship with the 'dept_no' foreign key in the 'dept_manager' table")

#determine the max number identical employee numbers
print(max(dept_manager_df["emp_no"].value_counts()))

print("The 'emp_no' primary key in the 'employees' table has " +
      "a one-to-one relationship with the 'emp_no' foreign key in the 'dept_manager' table")

4
The 'dept_no' primary key in the 'departments' table has a one-to-many relationship with the 'dept_no' foreign key in the 'dept_manager' table
1
The 'emp_no' primary key in the 'employees' table has a one-to-one relationship with the 'emp_no' foreign key in the 'dept_manager' table

## "dept_emp" Table Relationships

In [9]:
dept_employee_df = pd.read_csv("../dept_emp.csv")

dept_employee_df.head()

   emp_no dept_no   from_date     to_date
0   10001    d005  1986-06-26  9999-01-01
1   10002    d007  1996-08-03  9999-01-01
2   10003    d004  1995-12-03  9999-01-01
3   10004    d004  1986-12-01  9999-01-01
4   10005    d003  1989-09-12  9999-01-01

In [47]:
#determine the max number identical department numbers
print(max(dept_employee_df["dept_no"].value_counts()))

print("The 'dept_no' primary key in the 'departments' table has " +
      "a one-to-many relationship with the 'dept_no' foreign key in the 'dept_emp' table")

#determine the max number identical employee numbers
print(max(dept_employee_df["emp_no"].value_counts()))

print("The 'emp_no' primary key in the 'employees' table has " +
      "a one-to-many relationship with the 'emp_no' foreign key in the 'dept_emp' table")

#need a composite key for the PK - determine if dept_no's are unique for duplicate employees, or if from_date's are unique for 
#duplicate employees - guess is that from_date's are unique (move up in same department)
duplicate_employees = dept_employee_df["emp_no"].value_counts()
duplicate_employees = duplicate_employees.loc[duplicate_employees > 1]
duplicate_employees = duplicate_employees.index
check_rows_df = dept_employee_df.loc[dept_employee_df["emp_no"].isin(duplicate_employees), :]
test_dept_unique = check_rows_df.groupby("emp_no").apply(lambda x: len(set(x)) == 1)
print("Are the department values different for each employee number? {}".format(not any(test_dept_unique)))

print("So we can make a composite key from employee number and dept number for this table, since the combinations of 'emp_no'"+ 
      " and 'dept_no' are unique")

85707
The 'dept_no' primary key in the 'departments' table has a one-to-many relationship with the 'dept_no' foreign key in the 'dept_emp' table
2
The 'emp_no' primary key in the 'employees' table has a one-to-many relationship with the 'emp_no' foreign key in the 'dept_emp' table
Are the department values different for each employee number? True
So we can make a composite key from employee number and dept number for this table, since the combinations of 'emp_no' and 'dept_no' are unique

## "employees" Table Relationships

In [20]:
employee_df = pd.read_csv("../employees.csv")

employee_df.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [21]:
#determine the max number identical employee numbers
print(max(employee_df["emp_no"].value_counts()))

print("There are no duplicate employee numbers in the 'employees' table, so 'emp_no' can be used as a primary key")

1

## "salaries" Table Relationships

In [22]:
salaries_df = pd.read_csv("../salaries.csv")

salaries_df.head()

   emp_no  salary   from_date     to_date
0   10001   60117  1986-06-26  1987-06-26
1   10002   65828  1996-08-03  1997-08-03
2   10003   40006  1995-12-03  1996-12-02
3   10004   40054  1986-12-01  1987-12-01
4   10005   78228  1989-09-12  1990-09-12

In [24]:
#determine the max number identical employee numbers - in the emp_no column
print(max(salaries_df["emp_no"].value_counts()))

print("There are no duplicate employee numbers in the 'salaries' table, so 'emp_no' here has a one-to-one relationship with "+
     "the 'emp_no' primary key from the 'employees' table")

1
There are no duplicate employee numbers in the 'salaries' table, so 'emp_no' here has a one-to-one relationship with the 'emp_no' primary key from the 'employees' table

## "titles" Table Relationships

In [25]:
titles_df = pd.read_csv("../titles.csv")

titles_df.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [26]:
#determine the max number identical employee numbers - in the emp_no column
print(max(titles_df["emp_no"].value_counts()))

print("There are duplicate employee numbers in the 'titles' table, so 'emp_no' here has a many-to-one relationship with "+
     "the 'emp_no' primary key from the 'employees' table")

3
There are no duplicate employee numbers in the 'salaries' table, so 'emp_no' here has a one-to-one relationship with the 'emp_no' primary key from the 'employees' table